In [1]:
import gcp.bigquery as bq
import pandas as pd
import numpy as np

In [2]:
%%bigquery schema --table "nyc-tlc:green.trips_2015"

In [3]:
%%sql
SELECT DAYOFYEAR(pickup_datetime) AS daynumber FROM [nyc-tlc:green.trips_2015] LIMIT 10

QueryResultsTable job_X5zYLvBpciz8vmBVVElpJQLLPT8

In [4]:
%%sql --module taxiquery
SELECT daynumber, COUNT(*) AS numtrips FROM
    (SELECT DAYOFYEAR(pickup_datetime) AS daynumber FROM [nyc-tlc:green.trips_$YEAR])
GROUP BY daynumber ORDER BY daynumber

In [5]:
trips = bq.Query(taxiquery, YEAR=2015).to_dataframe()
trips[:5]

   daynumber  numtrips
0          1     62943
1          2     43410
2          3     53866
3          4     41602
4          5     41923

In [6]:
avg = np.mean(trips['numtrips'])
print 'Just using average={0} has RMSE of {1}'.format(avg, np.sqrt(np.mean((trips['numtrips'] - avg)**2)))

Just using average=54674.0994475 has RMSE of 10163.4654442

In [7]:
%%sql
SELECT * FROM [fh-bigquery:weather_gsod.stations]
WHERE state = 'NY' AND wban != '99999' AND name contains 'LA GUARDIA'

QueryResultsTable job_zUkurjjvixwHaXeI8NCTT1_RnHU

In [8]:
%%sql --module wxquery
SELECT DAYOFYEAR(TIMESTAMP('$YEAR'+mo+da)) daynumber,
       FIRST(DAYOFWEEK(TIMESTAMP('$YEAR'+mo+da))) dayofweek,
       MIN(min) mintemp, MAX(max) maxtemp, MAX(IF(prcp=99.99,0,prcp)) rain
FROM [fh-bigquery:weather_gsod.gsod$YEAR]
WHERE stn='725030' GROUP BY 1 ORDER BY daynumber DESC

In [9]:
weather = bq.Query(wxquery, YEAR=2015).to_dataframe()
weather[:5]

   daynumber  dayofweek  mintemp  maxtemp  rain
0        365          5     46.0     48.2  0.17
1        364          4     34.0     48.0  0.13
2        363          3     33.8     46.9  0.37
3        362          2     39.0     62.1  0.02
4        361          1     46.0     62.6  0.14

In [10]:
data = pd.merge(weather, trips, on='daynumber')
data[:5]

   daynumber  dayofweek  mintemp  maxtemp  rain  numtrips
0        181          3     64.0     82.0  0.00     42978
1        180          2     62.1     78.1  0.26     41397
2        179          1     60.1     73.9  1.32     54632
3        178          7     62.1     80.1  0.00     74883
4        177          6     69.1     84.9  0.00     58371